{
	"main": {
		"name":"Kelly",
		"occupation":"Software Engineer",
		"description":"Finding creative approaches, while working through the full life cycle of development projects, is what I do. I'm always eager to learn new technologies and expand myself as an developer, but I especially enjoy UI/UX work and creating intuitive software made for the best user experience.",
		"image":"profilepic_florence.jpg",
		"bio":"Originally from the suburbs of New York City, I graduated from WashU in 2018. The summer before I graduated, I participated in a coding fellowship and now am developing a career in tech. I'm always looking for ways to expand my horizons in this industry and learn new technologies. Below is a link to my resume, and in the next section, you can read a little about my roles.",
		"email": "kellyjung96@gmail.com",
		"website": "http://www.kellysjung.com",
		"resumedownload":"https://drive.google.com/file/d/1PkXVVxvQqQTEn93CEDhG5i5_10y18mcL/view?usp=sharing",
		"Social":[
		{
			"name":"linkedin",
			"url":"https://www.linkedin.com/in/kellysjung/",
			"className":"fa fa-linkedin"
		},
		{
			"name":"github",
			"url":"http://github.com/kellysjung",
			"className":"fa fa-github"
		},
		{
			"name":"email",
			"url":"mailto:kellyjung96@gmail.com",
			"className":"fa fa-envelope"
		},
		{
			"name":"resume",
			"url":"https://drive.google.com/file/d/1PkXVVxvQqQTEn93CEDhG5i5_10y18mcL/view?usp=sharing",
			"className":"fa fa-file"
		}
		]
	},
	"resume":{
		"education":[
			{
				"school":"Washington University in St. Louis",
				"degree":"Bachelor of Arts in Psychology",
				"graduated":"May 2018",
				"description":"Minor in Computer Science"
			}
		],
		"experience":[
			{
				"company":"Less Annoying CRM",
				"website":"https://www.lessannoyingcrm.com/",
				"positions":[
					{
						"title":"Software Enginner",
						"years":"January 2019 - present",
						"description":"At LessAnnoyingCRM the development team members all work on full stack projects but also fall into their own niches. I like to get creative, so I've picked up many front-end projects, altering the entire outlook of our product. Since joining, I have developed a passion for UI/UX design and am continuing to find places where we can make improvements to our product. I also contribute to altering our back-end when implementing new feature requests and aide our customers with their CRM needs by providing technical support and developing solutions for any software bugs."
					},
					{
						"title":"CRM Coach / Junior Software Engineer",
						"years":"July 2018 - Dec 2018",
						"description":"My start at LACRM was on a rotational basis. While as a CRM Coach, I continued to develop my coding skills through various web development projects. Coordinating with our web designer, I took mock ups and brought them to reality. During this time, I also really familiarized myself with PHP and MySQL, as I altered our internally-used CMS and public facing site. Being on the support team allowed me to really understand our customer base and their software needs."
					},
					{
						"title":"Coding Fellow",
						"years":"May 2017 - Aug 2017",
						"description":"LACRM Coding Fellowship aims to teach coding skills to people from underrepresented groups in tech in order to promote diversity in the industry. The fellowship aims to prepare individuals for careers in tech. I was proud to be part of the first class of fellows here, and by the end, I had drastically improved my coding skills, enough for me to seamlessly transition into a full-time role after rotating for a few months."
					}
				]
			},
			{
				"company":"Washington University in St. Louis Career Center",
				"website":"https://students.wustl.edu/career-center/",
				"positions":[
					{
						"title":"Career Peer (Student Advisor Intern)",
						"years":"March 2017 - May 2018",
						"description":"The Career Peers are a team of students who meet 1:1 with fellow students on a walk-in basis to help with anything in the career development, from resume writing to interviewing and networking skills. As a Career Peer, I was also the front-face of the Career Center, communicating with advisors, employers, and students to direct and provide answers for any questions pertaining to the center."
					}
				]
			}
		],
		"skillmessage":"Always learning, always improving! But at the moment, these are my skills.",
		"skills":[
			{
				"name":"PHP",
				"level":"100%"
			},
			{
				"name":"MySQL",
				"level":"100%"
			},
			{
				"name":"React JS",
				"level":"85%"
			},
			{
				"name":"TypeScript",
				"level":"85%"
			},
			{
				"name":"JavaScript",
				"level":"90%"
			},
			{
				"name":"Java",
				"level":"75%"
			},
			{
				"name":"HTML & CSS",
				"level":"100%"
			},
			{
				"name":"Git",
				"level":"80%"
			}
		]
	}
}